# #11111111111111
# puts "задание 1!"
# puts "введите множество точек, задавая координаты через пробел. сначала x, потом y"
# xArray = [] #массив координат иксов
# yArray = [] #массив координат игриков
# str = gets.to_s.chomp!
# #пример ввода :
# # (28,298)  (24,271)  (31,229)  (33,204)  (39,179)
# # (33,148)  (28,123)  (28,101)  (37,78)  (49,56)
# # (77,44)  (134,38)  (171,33)  (208,28)  (238,24)
# # (306,20)  (355,20)  (413,20)  (471,24)  (487,48)
# # (510,95)  (516,134)  (515,190)  (509,211)  (483,233)
# # (409,213)  (345,187)  (326,161)  (263,152)  (251,195)
# # (222,209)  (195,206)  (160,202)  (147,206)  (129,223)
# # (119,248)  (99,283)  (79,298)  (61,300)
# array = str.to_s.split(" ")
# n = 0
# begin #вводим данные, рассовываем по массивам
#   x, y = array[n].to_s.split(",")
#   x.to_s.tr!("(", "")
#   y.to_s.tr!(")", "")
#   xArray.push(x.to_f)
#   yArray.push(y.to_f)
#   n += 1
# end until n == array.length
#
# sum = 0.0
# (0..xArray.length.to_i - 2).each do |k|
#   sum += ((xArray[k].to_f + xArray[k + 1].to_f) * (yArray[k].to_f - yArray[k + 1].to_f)) #считаем по формуле площадь
# end
# sum += ((xArray[0] + xArray[xArray.length - 1]) * (yArray[yArray.length - 1] - yArray[0])) #досчитываем площадь
#
# sum = (sum.abs) / (2.to_f) #финальный досчет
#
# puts "площадь многоугольника = ", sum
#
# #11111111111111111
#

# #2222222222222222
# puts "задание 2!"
# puts "значение t: "
# t = gets.to_s.to_i
# puts "значение r: "
# r = gets.to_s.to_i
# puts "значение P: "
# pe = gets.to_s.to_i
#
# answer = ((pe ** r) * (1 - (pe ** (-t)))).to_f
# puts "ответ = ", answer.to_i
# #2222222222222222
#
#3333333333333333333
# puts "задание 3!"
# puts "введите двоичный код без пробелов и символов: "
#
# num = gets.to_s.chomp!
# n = num.length
# dec = 0
# array = num.to_s.split("")
#
# i = n - 1
# while i > -1 do
#   if (array[i] == "1")
#     dec += 2 ** (n - (i + 1))
#   end
#   i -= 1
# end
#
# print dec
#3333333333333333333
#
#44444444444
puts "задание 4!"
puts "введите десятичное число без пробелов и символов: "
num = gets.to_s.chomp!.to_i
answer = ""
while num != 0
  b = num % 2
  answer += b.to_s
  num = num / 2

end
print "ваше число двоичном коде ", answer.reverse!
#44444444444
